INSERT INTO member (id, status, nickname, friend_code, original_url, thumbnail_url, created_at, updated_at)
VALUES
    (1, 'ACTIVE', 'nick', 'ABCDEFG', 'keyme.space/original', 'keyme.space.thumbnail', '2023-08-05T16:07:00', '2023-08-05T16:07:00'),
    (2, 'ACTIVE', 'james', '1234567', 'keyme.space/original', 'keyme.space.thumbnail', '2023-08-05T16:07:00', '2023-08-05T16:07:00'),
    (3, 'ACTIVE', 'peter', 'A1B2C3D', 'keyme.space/original', 'keyme.space.thumbnail', '2023-08-05T16:07:00', '2023-08-05T16:07:00');

INSERT INTO `question` (`title`, `keyword`, `category_name`, `is_onboarding`)
VALUES
    ('새로운 사람들과 대화하는 것을 즐기시겠군요?', '대화', '사회적_활동', false),
    ('규칙과 규제를 엄격하게 준수하시나요?', '규칙', '성격_및_특성', false),
    ('문제가 발생했을 때 논리적으로 대처하실 것 같아요?', '대처', '문제_해결', false),
    ('새로운 환경과 변화에 적응하는 것을 좋아하시겠군요?', '적응', '삶의_변화', false),
    ('다른 사람들에게 조언을 주는 것을 좋아하시겠군요?', '조언', '인간관계', false),
    ('혼자만의 시간을 즐기시겠군요?', '혼자', '개인적_성향', false);


INSERT INTO `question` (`title`, `keyword`, `category_name`, `is_onboarding`)
VALUES
    ('함께 시간을 보내는 것을 좋아하시나요?', '함께', '인간관계', true),
    ('새로운 사람들과 친해지는 것을 좋아하시나요?', '친해지는', '사회적_활동', true),
    ('여행을 즐기시겠군요?', '여행', '레저_및_여가', true),
    ('계획적이고 체계적인 성향을 가지고 계시나요?', '계획적', '성격_및_특성', true),
    ('감정을 잘 드러내시진 않을 것 같군요?', '감정', '감정_표현', true),
    ('자신의 의견을 확고하게 말하시나요?', '의견', '의사_표현', true),
    ('도전적인 상황에서 도전을 즐기실 것 같네요?', '도전', '성취_및_도전', true),
    ('새로운 아이디어와 경험에 열려있으실 것 같아요?', '아이디어', '창의성', true),
    ('예술과 창작적인 분야에 흥미를 느끼시겠군요?', '예술', '예술과_문화', true),
    ('타인과의 협력을 중요하게 생각하시나요?', '협력', '인간관계', true);

INSERT INTO statistic (id, owner_id, question_id, solver_count, owner_score, solver_avg_score, match_rate, created_at, updated_at)
VALUES
    (1, 1, 1, 3, 5, 1, 20, '2023-08-05T16:07:00', '2023-08-05T16:07:00'),
    (2, 1, 2, 3, 5, 2, 22, '2023-08-05T16:07:00', '2023-08-05T16:07:00'),
    (3, 1, 3, 3, 5, 2, 25, '2023-08-05T16:07:00', '2023-08-05T16:07:00'),
    (4, 1, 4, 3, 5, 3, 33.33, '2023-08-05T16:07:00', '2023-08-05T16:07:00'),
    (5, 1, 5, 3, 5, 4, 50, '2023-08-05T16:07:00', '2023-08-05T16:07:00'),
    (6, 1, 6, 3, 5, 5, 100, '2023-08-05T16:07:00', '2023-08-05T16:07:00');
--     (7, 1, 7, 3, 5, 1, 20, '2023-08-05T16:07:00', '2023-08-05T16:07:00'),
--     (8, 1, 8, 3, 5, 1, 20, '2023-08-05T16:07:00', '2023-08-05T16:07:00'),
